Revit 2027 API
AnnotationMultipleAlignmentUtils.GetAnnotationCenter Method
 Gets the center of the alignable element in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static XYZ GetAnnotationCenter(
	Element element
)
Public Shared Function GetAnnotationCenter (
	element As Element
) As XYZ
public:
static XYZ^ GetAnnotationCenter(
	Element^ element
)
static member GetAnnotationCenter :
        element : Element -> XYZ
Parameters
element Element
 The element for which we are retrieving the center.
Return Value
XYZ
 The center point of the alignable element.
Exceptions
Exception | Condition
ArgumentException |  The element element does not support multiple alignment behavior. -or-
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace